''' Теория

# Что увидим на экране после запуска следующей программы?
print('Жизнь как коробка шоколадных конфет')
print
print('никогда не знаешь, что тебе попадётся.')
# Жизнь как коробка шоколадных конфет
# никогда не знаешь, что тебе попадётся
# Ошибки не будет, но и переноса на новую строчку от пустого принта также не будет, поскольку не было вызова функции print при помощи скобок ()


# почему будет ошибка?
print('Вы', 'когда-нибудь', 'мечтали',  sep='!')
print('стать лучшей', 'версией', 'себя', end=?)

'''

